Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: Are you crying?
jbo: xu do klaku

source: Are we friends?
jbo: mi'o pedysi'u xu

source: Am I going to die?
jbo: xu mi ba mrobi'o

source: Why didn't you call for help?
jbo: mu'i ma do na'e djucpe

source: Why are people scared of Tom?
jbo: ki'u ma da terpa la .tam.

source: Who's laughing?
jbo: ma cmila

source: Who's in charge here?
jbo: ma catni

source: Who's getting married?
jbo: ma spebi'o

source: Who's complaining?
jbo: ma pante

source: Who's been talking to Tom?
jbo: ma la .tam. pu tavla

source: Who took the money?
jbo: ma loi jdini pu lebna

source: Who told you to tell Tom to come?
jbo: ma minde do lo nu minde la .tam. lo nu klama

source: Where was this picture taken?
jbo: ma stuzi lo nu kacmyterxra ti

source: Where did Tom go?
jbo: la .tam. ma pu klama

source: Where did that come from?
jbo: ta fi ma pu klama

source: Where did it come from?
jbo: ko'a fi ma pu klama

source: Where are your car keys?
jbo: lo do karcyckiku ma zvati

source: Where are you headed?
jbo: do ma ca'o klama

source: Where are you going to put it?
jbo: do ti ba punji ma

source: Where are you going to go?
jbo: do ma ba klama

source: Where are we now?
jbo: mi'o ma ca zvati

source: Where are we going to go?
jbo: mi'o ma ba klama

source: Where are Tom's things?
jbo: lo se srana be la .tam. ma zvati

source: Where are they?
jbo: ko'a ma zvati

source: Where are the car keys?
jbo: le karcyckiku ma zvati

source: Where are my things?
jbo: lo mi se srana ma zvati

source: Where are my car keys?
jbo: lo mi karcyckiku ma zvati

source: When's the funeral?
jbo: mrobixsla ti'u ma

source: What'll we do?
jbo: mi'o ba mo

source: What did you see?
jbo: fe ma do pu viska

source: What did you find out?
jbo: do ma facki

source: Was Tom alone?
jbo: la .tam. nonkansa xu

source: She has one too.
jbo: ko'a ji'a ralte

source: I can hear the wind.
jbo: mi tirna lo brife

source: I didn't ask for this.
jbo: mi na pu cpedu tu'a zo'e bi'ucu'i

source: I found out where Tom used to live.
jbo: mi facki lo du'u la .tam. makau ba'o xabju

source: I found out whose airplane crashed.
jbo: mi facki lo du'u lo makau vinji cu janli

source: I have to go.
jbo: mi cliva .ei

source: I just met him.
jbo: mi puzi penmi ko'a

source: I just saw the news.
jbo: mi pu zi ve nuzba

source: I know Tom says he doesn't like me.
jbo: mi djuno lo du'u la .tam. cu cusku lo sedu'u to'e nelci mi

source: I think we should reduce the price.
jbo: .e'u jdikygau lo jdima

source: Why don't you buy a vehicle?
jbo: mu'i ma mi'o na tervecnu lo marce

source: I'll be going with you.
jbo: mi do klama kansa

source: I'll tell you.
jbo: mi do ba jungau

source: I'm getting a cat.
jbo: mi co'a ralte lo mlatu

source: I'm not afraid of you.
jbo: mi do na terpa

source: I'm not your boyfriend.
jbo: mi na pampe'o do

source: I'm ready.
jbo: mi bredi

source: I'm the killer.
jbo: mi catra

source: I'm wide awake.
jbo: mi mutce cikna

source: We understand.
jbo: mi'a jimpe

source: We need to go.
jbo: mi'a cliva .ei

source: We have to leave now.
jbo: ei cliva nau

source: We have to go now.
jbo: ei mi'ai klama nau

source: Thank God it's over.
jbo: .uo.oinai

source: Let us begin.
jbo: xa'emi'o tolsti

source: He does not wear a hat.
jbo: na sedyta'u

source: Love will prevail.
jbo: lo nu prami ba turni

source: It's worth it.
jbo: ra vamji ra

source: It's nothing to be ashamed of.
jbo: na se ckeji

source: It's not safe here.
jbo: na vi snura

source: It's not mine.
jbo: mi nai ralte ko'a

source: It's not going to be easy.
jbo: ba na frili

source: It's not fair.
jbo: pa'enai

source: It's not a date.
jbo: na nu pamli'u

source: It's hopeless.
jbo: .a'onaicai

source: It's grotesque.
jbo: tolmelbi

source: It's gorgeous.
jbo: tcemelbi

source: It's different.
jbo: frica

source: It's dangerous here.
jbo: vi tolsnura

source: It's complicated.
jbo: pluja

source: It's cold out.
jbo: lenku

source: It's cold out there.
jbo: va lenku

source: It's cold in here.
jbo: ne'i lenku

source: You're weird.
jbo: do cizra

source: You have to help me.
jbo: do e'i sidju mi

source: That's a myth.
jbo: ra ranmi

source: What Tom really wanted was to be happy.
jbo: la .tom. pu ja'a djica lo du'u ri gleki kei kau

source: This isn't funny.
jbo: .u'inai

source: This is weird.
jbo: cizra

source: This is a joke.
jbo: ti me lo se xamgau

source: Please don't do that.
jbo: do e'o na zukte tai

source: Six times four is two dozen.
jbo: li xa pi'i vo du li reno ju'u gai

source: How often do you wash your clothes?
jbo: ca ro ma do lumci lo taxfu be do

source: "Says who?" "Says me."
jbo: lu go'i cu'u ma li'u lu mi li'u

source: Be proud of yourself.
jbo: ko tu'a ko jgira

source: The boys in the village laughed at me.
jbo: .o'anai lo cmatca nanla pu cu mi'arckasu mi

source: I'm not going to play this game.
jbo: mi ba ci'erkei .ainai

source: I'm ashamed of what I did.
jbo: .o'anai mi pu gasnu

source: Be nice.
jbo: ko clite

source: In Hans Christian Andersen's classic fairy tale, "The Emperor's New Clothes," two swindlers promise an emperor beautiful new clothes that are invisible to anyone who is unfit for their position, unjust or stupid.
jbo: va'o lo banli lisri pe fi'e la .kristian.anasn. zi'e pe me'e lu lo cnino taxfu be lo balnoltru li'u lo re tcica cu nupre fi lo balnoltru fe tu'a lo cnino taxfu poi na ka'e se viska da poi ke'a na mapti lo ke'a jibri gi'a nalvu'e gi'a bebna

source: I'll be damned, if by the end of the movie the chef doesn't turn out to be the killer.
jbo: .iacai ca lo nu skina mulno ku le jukpa cu du le catra

source: I looked at myself in the mirror and I didn't like what I saw.
jbo: mi te minra mi .i mi na nelci lo ve minra

source: Let's finish the job.
jbo: mi'o ko'oi mulgau

source: His father became ill with cancer.
jbo: lo patfu be ko'a pu se kenra binxo

source: My son is a rebellious teenager.
jbo: lo bersa be mi cu flapro citnau

source: He's stupid and dishonest.
jbo: ko'a tolmencre je nalstace

source: She's stupid, but honest.
jbo: ko'a tolmencre je ku'i stace

source: A gunshot was heard in the distance.
jbo: lo nu celxa'igau cu vu se tirna

source: What does it feel like?
jbo: cinmo ma

source: How did it feel like?
jbo: pu cinmo ma

source: Thank you my dear.
jbo: .o'e ki'e

source: What have we done?
jbo: mi'a pu mo

source: When are we going to do it?
jbo: mi'o go'a ti'u ma

source: No, I can't clean your house. It's too big!
jbo: mi na kakne lo nu lumci le zdani be do .imu'ibo dukse barda

source: I will teach you.
jbo: mi ba ctuca do

source: I'm old.
jbo: mi laldo

source: Tom says he won't vote.
jbo: la .tam. cusku lo sedu'u na cmicu'a

source: Does anyone speak Japanese?
jbo: xu da se ponbau

source: Hello, have you already eaten?
jbo: coi xu do co'i citka

source: The girl who works at that bakery is cute.
jbo: le nanmu poi te nabzai cu citmle

source: Tom said that he wanted to be left alone.
jbo: la .tam. cusku lo du'u djica lo nu tolkansa

source: I think love does not exist.
jbo: mi jinvi lo du'u lo nunprami cu na zasti

source: It's the world's oldest profession.
jbo: traji crejibri

source: It's as old as the hills.
jbo: mutce slabu

source: When he heard the news, he turned pale.
jbo: ca ve nuzba ku ko'a labybi'o

source: She didn't get the joke.
jbo: ko na jimpe le zdilisri

source: That's why I share this news.
jbo: mukti lo nu mi te nuzba

source: Sun and rain, rainbow.
jbo: solri je carvi .i tanbargu

source: He has small feet.
jbo: le jamfu be ko'a cmalu

source: I am a sculpture.
jbo: mi se laryrakpra

source: We think too much and feel too little.
jbo: dukse pensi je toldu'e cinmo

source: Better leave it!
jbo: ko nalra'u

source: Tom was an orphan.
jbo: la .tam. narselrirni

source: What is your advice?
jbo: djusku ma

source: That old guy is really nice.
jbo: le va slabu nanmu cu mutce jaxpu'a

source: He disappeared.
jbo: canci

source: Are you gonna pay for it?
jbo: xu do ba pleji

source: It's a deadly poison!
jbo: morsi vindu

source: Doctor, it's the wrong leg!
jbo: doi mikce .i toldra tuple

source: What horrible events took place? Where are you parents? What happened to your husband?
jbo: jenca mo .i ma zvati lo do rirni .i lo do nakspe cu mo

source: They're all dead! All dead! All dead!
jbo: cai roko'a morsi .i morsi .i morsi

source: I prefer your brandy to your conversation.
jbo: mi nelzma loi do vanjyjikru lo do nuncasnu

source: Throw him in the water!
jbo: ko nenri be lei djacu be'o renro ko'a

source: What! Holk had a son? But he was not married.
jbo: .uanaicai la .xulk. binxo se bersa .i ku'i na speni

source: We went bear hunting together the other day.
jbo: lu'o mi'a puza kalte cribe

source: We need a steamboat.
jbo: mi'o nitcu lo jaugacbloti

source: Be careful, don't remove the cap. It's arsenic!
jbo: .e'unai ko na vimcu le makpu .i cai relcibselratni

source: Now, my young man, jump out the window!
jbo: ko noi nanla .io cu plipe pagre le canko

source: I would like to know if he knows that Mary lives near here.
jbo: mi djica lo nu djuno lo jei ko'a djuno lo du'u la .meris. vi xabju

source: "Mary, will you answer my question?" asked Adle while trying to control her excitement.
jbo: lu doi .meris. .i .e'o ko spuda li'u se retsku la .adEl. noi troci lo nu jitro lo ka xanka

source: All of a sudden, the door opened and a man entered the room.
jbo: le vrogai cu suksa binxo kalri .i lo nanmu cu nerkla le kumfa

source: In the name of God, protect me from this crazy woman!
jbo: .iicai ko bandu mi lo nu ti noi fenki ninmu cu gunta

source: Tam says he wants a group activity.
jbo: la .tam. cusku lo du'u djica lo nu tolkansa

source: She's intelligent and sexy.
jbo: mencre je cinmle

source: He's sexy and intelligent.
jbo: cinmle je mencre

source: He wants to talk to you.
jbo: ko'a djica lo nu tavla do

source: She wants to talk to you.
jbo: ko'a djica lo nu tavla do

source: Do you want to look at it?
jbo: xu do djica lo nu viska

source: Does he want to look at it?
jbo: xu ko'a djica lo nu viska

source: Does she want to look at it?
jbo: xu ko'a djica lo nu viska

source: There's something I have to tell you.
jbo: mi nitcu lo nu cusku da do

source: He's going to cross the river.
jbo: ko'a ba klama pa'o lo rirxe ku

source: Sadly, Tom doesn't read books.
jbo: .uinai la .tam. na ve cukta

source: Wake up Tom!
jbo: doi .tam. ko cikybi'o

source: Truer words have never been spoken.
jbo: .iecai

source: I think I can prove it.
jbo: mi jinvi lo du'u kakne lo nu je'urja'o

source: He thinks he can prove it.
jbo: ko'a jinvi lo du'u kakne lo nu je'urja'o

source: She thinks she can prove it.
jbo: ko'a jinvi lo du'u kakne lo nu je'urja'o

source: You're such a liar.
jbo: do dukse ticysku .ionai

source: Just a little bit
jbo: cmalu klani

source: The beautiful is always strange.
jbo: lo'e melbi cu roroi cizra

source: I'm not your girlfriend.
jbo: mi na pampe'o do

source: I'm not your slave.
jbo: mi na selbapselfu do

source: I don't care what your mother said.
jbo: mi toljunri lo nu le do mamta pu cusku makau

source: She asked me for money.
jbo: ko'a cpedu loi jdini mi

source: He asked me for money.
jbo: ko'a cpedu loi jdini mi

source: There's a swimming pool and a bowling alley.
jbo: va limla'u je bolgu'odi'u

source: My friend helped me.
jbo: le pendo cu sidju mi

source: Don't look at this!
jbo: ko na viska

source: Don't look at me!
jbo: ko na viska mi

source: Don't look at him!
jbo: ko na viska ko'a

source: Don't look at her!
jbo: ko na viska ko'a

source: It's getting dark.
jbo: manku binxo

source: This is highly irregular.
jbo: dukse vitci

source: You will regret this.
jbo: do ba xenru

source: He will regret this.
jbo: ko'a ba xenru

source: She will regret this.
jbo: ko'a ba xenru

source: I want vengeance.
jbo: mi venfu djica

source: She wants vengeance.
jbo: ko'a venfu djica

source: He wants vengeance.
jbo: ko'a venfu djica

source: I want a beer.
jbo: mi po'edji loi birje

source: You look very good.
jbo: do melbi

source: There's no hope.
jbo: .a'onaicai

source: Let me go.
jbo: ko curmi lo nu mi cliva

source: Let her go.
jbo: ko curmi lo nu ko'a cliva

source: Let him go.
jbo: ko curmi lo nu ko'a cliva

source: Let Tom go.
jbo: ko curmi lo nu la .tam. cliva

source: I'd like to ask you about how to do that.
jbo: .au mi reisku fi do fe lo se du'u mi zukte makau da bi'unai

source: I'd like to apologize.
jbo: mi xerskudji

source: What's for lunch?
jbo: ma dormijysai

source: She met her uncle.
jbo: ko'a penmi le famti

source: Do you want wine?
jbo: xu do djica lo nu pinxe loi vanju

source: How goes it, Jacques?
jbo: coi .djaks. .i do mo

source: Silence in the court!
jbo: ne'i le flapaizda ku ko smaji

source: He who steals a belt buckle will be executed; he who steals a state becomes a prince.
jbo: lo remna poi lebna lo befsri stela ba mi'erselcatra .i lo remna poi lebna lo gugde ba turni binxo

source: That's a great start !
jbo: .i'ecai cfari

source: At home I have a Espresso maker.
jbo: vi le mi zdani ku ckafrspreso mi'izba

source: The first time I had Sushi was fantastic.
jbo: le nu mi pamoi citka loi cidjrsuci cu mutce pluka

source: This is an ordinary task.
jbo: fadni selgu'a

source: What do all have in common?
jbo: roda ckaji ma

source: My boyfriend refuses to use the microwave.
jbo: le mi pampe'o toldji lo nu pilno le bo'atoknu

source: If something is fun, I like to do it, of course.
jbo: ganai zdifri gi mi nelci li'a

source: Are you happy with that?
jbo: .i'epei

source: I think that's great!
jbo: du'o mi xamgu

source: Is this a gift for me?
jbo: dunda ti mi xu

source: Everything will change.
jbo: roda ba ficybi'o

source: Open that thing!
jbo: ko kargau ti

source: What is it now?
jbo: .oi mo

source: You got those from a field?
jbo: xu do cpacu ti lo foldi

source: Look at that!
jbo: ko viska

source: I am very happy that you have been with us today.
jbo: mi gleki lo za'i do pu kansa mi'a

source: I do notice it.
jbo: ja'a mi cfaga'e

source: No one seems to listen to us anymore.
jbo: noda si'au ca'o tinju'i mi'ai

source: I came on foot.
jbo: mi dzukla

source: There's a coffee shop in front of the station.
jbo: kafyzai ca'u le tcana

source: I thought you'd been killed. I'm glad I was wrong.
jbo: mi pu jinvi lo nu do pu se catra i mi gleki lo nu mi pu srera

source: I thought they wouldn't like you.
jbo: mi pu jinvi lo du'u ra na nelci do

source: I thought Tom wouldn't give up.
jbo: mi pu jinvi lo du'u la .tam. na radycru

source: I thought you wouldn't give up.
jbo: mi pu jinvi lo du'u do na radycru

source: I thought Tom wouldn't come.
jbo: mi pu jinvi lo du'u la .tam. na klama

source: I thought they wouldn't come.
jbo: mi pu jinvi lo du'u na klama

source: She was afraid of travelling alone.
jbo: ko'a terpa lo nu nonkansa klama

source: The English are polite.
jbo: le prenu poi brito cu clite

source: I don't like him very much. To tell you the truth, I hate him.
jbo: mi no'e nelci .ije'u mi xebni

source: Please wait a minute.
jbo: pe'u ko ze'i denpa

source: Where's the nearest metro stop?
jbo: le renytcana poi raijibni ku'o ma zvati

source: He who drinks, will drink.
jbo: le ca xalpinxe ba xalpinxe

source: This little jug is historic; it's more than eighty years old.
jbo: ti noi cmalu patxu cu cirvai .i ri nanca li za'u bino

source: I hate it, yet I'm uncontrollably drawn to it.
jbo: mi xebni gi'eku'i toljitro se trina

source: Tom is ready to fight.
jbo: la .tam. bredi lo nu damba

source: My sister is a very good typist.
jbo: le mi mensi cu certu batkyci'a

source: She is young and immature.
jbo: verba je tolmakcu

source: He is young and immature.
jbo: verba je tolmakcu

source: He's a devout Catholic.
jbo: mutce la'orxi'o

source: She's a devout Catholic.
jbo: mutce la'orxi'o

source: I've got to speak to you.
jbo: mi nitcu lo nu tavla do

source: I've got to speak to her.
jbo: mi nitcu lo nu tavla ko'a

source: I've got to speak to him.
jbo: mi nitcu lo nu tavla ko'a

source: I've got to speak to Tom.
jbo: mi nitcu lo nu tavla la .tam.

source: I'm not your father.
jbo: mi na patfu do

source: It's unthinkable that you would sunbathe, naked, on this balcony.
jbo: .a'unaicai do lunbe solvre le vi balni

source: Believe in science!
jbo: ko krici do'e lo saske

source: Believe in love!
jbo: ko krici do'e lo nu prami

source: To know is to know that you know nothing. That is the meaning of true knowledge.
jbo: lo nu djuno cu se smuni lo nu djuno lo du'u nonydjuno .i la'edi'u smuni lo ka djuno

source: Sometimes telling the truth hurts.
jbo: so'uroi cnicro lo nu sacysku

source: It is a song.
jbo: selsa'a

source: This isn't silver.
jbo: ti na rijno

source: Juan doesn't know that Maria is his daughter.
jbo: la .uan. na djuno lo du'u la .marias. cu tixnu vo'a

source: His bed is next to the wall.
jbo: ko'a te ckana ne'a le bitmu ku

source: I think she's going to be sick.
jbo: ba'a pu vamtu

source: I think he's going to be sick.
jbo: ba'a pu vamtu

source: It's important that I hear this.
jbo: lo nu mi te cusku cu vajni

source: It's important that you hear this.
jbo: lo nu do te cusku cu vajni

source: It's important that he hears this.
jbo: lo nu ko'a te cusku cu vajni

source: It's important that she hears this.
jbo: lo nu ko'a te cusku cu vajni

source: Romeo instantly fell in love with Juliet.
jbo: la .romios. ze'i pambi'o la .djulIEt.

source: He instantly fell in love with her.
jbo: ze'i pambi'o

source: She instantly fell in love with him.
jbo: ze'i pambi'o

source: Tom is out of touch with reality.
jbo: la .tam. na se zasti

source: He's out of touch with reality.
jbo: na se zasti

source: She's out of touch with reality.
jbo: na se zasti

source: You're out of touch with reality.
jbo: do na se zasti

source: It's more fun than drinking coffee.
jbo: zdizma lo nu pinxe loi ckafi

source: It's more fun than drinking tea.
jbo: zdizma lo nu pinxe loi tcati

source: It's more fun than studying.
jbo: zdizma lo nu tadni

source: She took off her clothes.
jbo: pu lubybi'o

source: He took off his clothes.
jbo: pu lubybi'o

source: Take off your clothes.
jbo: ko lubybi'o

source: Are you sure this is what you want?
jbo: ju'oru'e xu do djica

source: This is the hardest thing I've ever done.
jbo: traji nunselnandu mi

source: This is the most enjoyable thing I've ever done.
jbo: traji nunselpluka mi

source: This is the worst thing I've ever done.
jbo: lo nu mi gasnu cu traji xlali

source: This is the stupidest thing I've ever done.
jbo: traji nunbebna mi

source: This is the strangest thing I've ever done.
jbo: traji nuncizra mi

source: He has short hair.
jbo: tordu se kerfa

source: The pain is agonizing.
jbo: mutce cortu

source: The pain was agonizing.
jbo: pu mutce cortu

source: He's wide awake.
jbo: mutce cikna

source: She's wide awake.
jbo: mutce cikna

source: He was wide awake.
jbo: mutce cikna

source: She was wide awake.
jbo: mutce cikna

source: This is a lot more fun than studying.
jbo: mutce zdizma lo nu tadni

source: Baseball is a lot more fun that golf.
jbo: lo ga'arboiterjvi cu mutce zdizma lo ke'arboiterjvi

source: Tom thinks that volleyball is more fun than basketball.
jbo: la .tam. jinvi lo du'u lo ju'erboiterjvi cu zdizma lo lankyboiterjvi

source: She's very innocent.
jbo: mutce zanbebna

source: This is going to be epic!
jbo: .ui.uenai

source: He was thrown in prison for robbery.
jbo: se pifygau mu'i lo nu zerle'a

source: I want to tell you something.
jbo: mi cusku .au fi do

source: Can you lend me some money? I'm skint.
jbo: pe'u mi dinjbera ko .imu'ibo loi mi jdini cu nomei

source: I knew I was making mistakes.
jbo: mi pu djuno lo du'u mi ca'o srera

source: Yesterday was a lot colder than today.
jbo: le prulamdei cu mutce lekyzma le djedi

source: It's chillier today.
jbo: le djedi cu lekyzma

source: The day was exhausting.
jbo: tatpi le nu djedi

source: Finding a house is stressful.
jbo: lo nu sisku lo zdani cu seldu'u

source: Your brother wasn't at school today.
jbo: le do bruna le ckule na zvati

source: I'll spend a very fun, stressful and exhausting Saturday evening!
jbo: .ai selzdifri je seldu'u je selta'i tedvanci

source: I'll spend a very fun, stressful and exhausting Saturday night!
jbo: .ai selzdifri je seldu'u je selta'i tedycte

source: I'll pass a very fun, stressful and exhausting Saturday evening!
jbo: .ainai selzdifri je seldu'u je selta'i tedvanci

source: I'll pass a very fun, stressful and exhausting Saturday night!
jbo: .ainai selzdifri je seldu'u je selta'i tedycte

source: Tomorrow, God willing, we'll be with your parents.
jbo: ti'u lo bavlamdei .a'ocai mi'o jibni le do rirni

source: He has a common name.
jbo: fadni se cmene

source: We can beat her!
jbo: mi'o ba jinga .ai

source: You look terrible. What happened?
jbo: .uucai do se xlali simlu ki'u ma

source: Who's this hot babe?
jbo: ma ti poi cinmle cu cmene

source: I'm not a nerd!
jbo: mi na malcrexalbo

source: You're a nerd.
jbo: do malcrexalbo

source: He's a nerd.
jbo: malcrexalbo

source: She's a nerd.
jbo: malcrexalbo

source: She followed me into the kitchen and picked up a knife.
jbo: klaje'i mi le jupku'a gi'e jgari lo dakfu

source: She followed me into the kitchen and picked up a knife. She then started cutting vegetables.
jbo: klaje'i mi le jupku'a gi'e jgari lo dakfu .i cfari lo nu staji katna

source: The cat is hiding under the couch.
jbo: le mlatu cu vobmipri ni'a le sfofa

source: Tom is hiding under the bed.
jbo: la .tam. cu vobmipri ni'a le ckana

source: He's hiding in the closet.
jbo: vobmipri ne'i le sroku'a

source: She's hiding in the closet.
jbo: vobmipri ne'i le sroku'a

source: They're hiding in the closet.
jbo: vobmipri ne'i le sroku'a

source: I'm fascinated by cats.
jbo: loi mlatu cu cinri mi

source: Would you please stop pacing around like that and just sit down for a second?
jbo: pe'u ko na peidzu gi'e ze'i zutse

source: Whose magical land is Dalat,the city of poetry?
jbo: ma ponse la .dalat. po'u le tcadu be do'e lo pemci

source: My brother died in a traffic accident.
jbo: le mi bruna pu se mrobi'o ri'a lo nunkarcyjanli

source: I'm older than you.
jbo: mi tolci'ozma do

source: You can't go home now.
jbo: sei nalcumki do klama lo zdani nau

source: You can't ignore Tom.
jbo: sei na se curmi do na jundi la Tom

source: Ask Tom.
jbo: preti fi ko la .tam.

source: Be still.
jbo: ko muvycau

source: Go on in.
jbo: ko nerkla

source: Leave me.
jbo: ko mi cliva

source: Leave us.
jbo: ko mi'a cliva

source: Marry me.
jbo: ko mi spebi'o

source: Use this.
jbo: ko ti pilno

source: Watch me.
jbo: ko mi zgana

source: Watch us.
jbo: ko mi'a zgana

source: I can't move my legs.
jbo: mi na kakne lo ka muvgau lo tuple be mi

source: I can't stand Tom.
jbo: mi na kakne lo ka renvi tu'a la tom

source: You can't stay here.
jbo: .e'a nai do ti stali

source: I can't tell my family.
jbo: ainai mi cusku fi lo lanzu be mi

source: I can't tell Tom that.
jbo: e'i mi na cusku da bi'unai la tom

source: I can't tell yet.
jbo: mi pu'o kakne lo ka danfu tecu'u do

source: Why is it that, as soon as someone says the word love, lust metamorphoses into passion?
jbo: ki'u ma cazi cusku zo prami ku lo ka cinydjica cu binxo lo ka cinmo

source: Please wait until the bus has come to a complete stop before standing up and retrieving your luggage.
jbo: pe'u ko lo nu lo sorpeka cu klasti cu denpa fu lo nu sa'irbi'o gi'e cpacu lo do klaselpo'e

source: Let's not be too hasty.
jbo: xa'e mi'o na sutra

source: If it's okay with you, I'd like to take it slow. I really don't want to rush into things.
jbo: .ainaisai mi masno djica

source: Tom's younger brother is dumb as a brick.
jbo: lo la .tam. citmau bruna cu mutce tolmencre

source: Stop being so bull-headed!
jbo: .o'onai ko na xarnu

source: This is the sentence which I can't translate.
jbo: mi na kakne lo nu fanva dei poi jufra
